app/controllers/home_controller.rb

SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "posts"
---
  def index
  	@posts = Post.all.order(created_at: :desc).page(params[:page]).per(5)