app/controllers/home_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
  	@posts = Post.all.reverse