app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "posts"
---
  def index
    @posts = Post.all.order(created_at: :desc).page(params[:page]).per(5)

INSERT INTO "posts" ("category_id", "content", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["category_id", 2], ["content", "Spoiler Naruto Shippuden"], ["created_at", Fri, 17 Jan 2014 04:53:22 UTC +00:00], ["title", "Naruto"], ["updated_at", Fri, 17 Jan 2014 04:53:22 UTC +00:00]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "title" = ?, "content" = ?, "updated_at" = ? WHERE "posts"."id" = 10  [["title", "Animal Crossing"], ["content", "Es un juego muy entretenido donde pones a prueba tus capacidades de socialización y decoración"], ["updated_at", Mon, 24 Feb 2014 16:37:44 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)